In [1]:
%load_ext sql

In [3]:
%sql sqlite:///TMDB-a-4006.db

'Connected: @TMDB-a-4006.db'

In [ ]:
--Who won the Oscar for “Actor in a Leading Role” in 2015?

In [5]:
%%sql

SELECt *

FROM oscars
WHERE award = 'Actor in a Leading Role'
  AND year = 2015
  AND winner = 1.0;

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[('2015', 'Actor in a Leading Role', '1.0', 'Leonardo DiCaprio', 'The Revenant')]

In [7]:
%%sql
PRAGMA table_info(oscars);

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(0, 'year', 'varchar(10)', 0, 'NULL', 0),
 (1, 'award', 'varchar(500)', 0, 'NULL', 0),
 (2, 'winner', 'varchar(10)', 0, 'NULL', 0),
 (3, 'name', 'varchar(500)', 0, 'NULL', 0),
 (4, 'film', 'varchar(500)', 0, 'NULL', 0)]

In [8]:
%%sql
SELECT name, film
FROM oscars
WHERE award = 'Actor in a Leading Role'
  AND year = 2015
  AND winner = 1.0;

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[('Leonardo DiCaprio', 'The Revenant')]

In [ ]:
--What query will produce the ten oldest movies in the database?

In [10]:
%%sql

SELECT
    title,
    release_date
FROM movies
ORDER BY release_date ASC
LIMIT 10;

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[('America Is Still the Place', None),
 ('Intolerance', '1916-09-04 00:00:00.000000'),
 ('The Big Parade', '1925-11-05 00:00:00.000000'),
 ('Metropolis', '1927-01-10 00:00:00.000000'),
 ("Pandora's Box", '1929-01-30 00:00:00.000000'),
 ('The Broadway Melody', '1929-02-08 00:00:00.000000'),
 ("Hell's Angels", '1930-11-15 00:00:00.000000'),
 ('A Farewell to Arms', '1932-12-08 00:00:00.000000'),
 ('42nd Street', '1933-02-02 00:00:00.000000'),
 ('She Done Him Wrong', '1933-02-09 00:00:00.000000')]

In [12]:
--How many unique awards are there in the Oscars table?

Object `table` not found.

In [14]:
%%sql
SELECT COUNT(DISTINCT award) AS unique_award_count
FROM oscars;

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(114,)]

In [16]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

In [17]:
%%sql
SELECT COUNT(*) AS spider_movie_count
FROM movies
WHERE title LIKE '%Spider%';

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(9,)]

In [ ]:
--How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?

Options:

In [18]:
%%sql
SELECT COUNT(*) AS thriller_love_movies
FROM movies
WHERE genre LIKE '%Thriller%'
  AND keywords LIKE '%love%';

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
(sqlite3.OperationalError) no such column: genre
[SQL: SELECT COUNT(*) AS thriller_love_movies
FROM movies
WHERE genre LIKE '%Thriller%'
  AND keywords LIKE '%love%';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [19]:
%%sql
PRAGMA table_info(movies);

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

In [20]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

In [22]:
%%sql
SELECT COUNT(DISTINCT m.movie_id) AS thriller_love_movies
FROM movies AS m
JOIN genremap AS gm ON m.movie_id = gm.movie_id
JOIN genres AS g ON gm.genre_id = g.genre_id
JOIN keywordmap AS km ON m.movie_id = km.movie_id
JOIN keywords AS k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(48,)]

In [ ]:
--How many movies are there that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000?

In [23]:
%%sql

SELECT COUNT(*) AS movie_count
FROM movies
WHERE release_date BETWEEN '2006-08-01' AND '2009-10-01'
  AND popularity > 40
  AND budget < 50000000;

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(29,)]

In [ ]:
--How many unique characters has "Vin Diesel" played so far in the database?

In [25]:
%%sql

PRAGMA table_info(casts);

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'actor_id', 'INTEGER', 1, None, 2),
 (2, 'characters', 'varchar(500)', 1, None, 3)]

In [26]:
%%sql
SELECT COUNT(DISTINCT c.characters) AS unique_characters_played
FROM casts AS c
JOIN actors AS a ON c.actor_id = a.actor_id
WHERE a.actor_name = 'Vin Diesel';

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[(16,)]

In [ ]:
--What are the genres of the movie “The Royal Tenenbaums”?

In [27]:
%%sql
SELECT g.genre_name
FROM movies AS m
JOIN genremap AS gm ON m.movie_id = gm.movie_id
JOIN genres AS g ON gm.genre_id = g.genre_id
WHERE m.title = 'The Royal Tenenbaums';

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[('Drama',), ('Comedy',)]

In [ ]:
--What are the three production companies that have the highest movie popularity score on average, as recorded within the database?

In [28]:
%%sql
SELECT pc.production_company_name,
       AVG(m.popularity) AS avg_popularity
FROM movies AS m
JOIN productioncompanymap AS pcm ON m.movie_id = pcm.movie_id
JOIN productioncompanies AS pc ON pcm.production_company_id = pc.production_company_id
GROUP BY pc.production_company_name
ORDER BY avg_popularity DESC
LIMIT 3;

 * sqlite:///TMDB-a-4006.db
   sqlite:///TMDB.db
Done.

[("The Donners' Company", 514.569956),
 ('Bulletproof Cupid', 481.098624),
 ('Kinberg Genre', 326.92099900000005)]

In [ ]:
--How many female actors (i.e. gender = 1) have a name that starts with the letter "N"?